const gregorianEvent = [
  {"Title": "آغاز سال ميلادي", "Day": 1, "Month": 1},
  {"Title": "روز جهاني كار و كارگر", "Day": 1, "Month": 5},
  {"Title": "روز جهاني صليب سرخ و هلال احمر", "Day": 8, "Month": 5},
  {"Title": " روز جهاني موزه و ميراث فرهنگي", "Day": 18, "Month": 5},
  {"Title": "روز جهاني محيط زيست", "Day": 5, "Month": 6},
  {"Title": " روز جهاني صنايع دستي", "Day": 10, "Month": 6},
  {"Title": "روز جهاني بيابان زدايي", "Day": 17, "Month": 6},
  {"Title": "روز جهاني مبارزه با مواد مخدر", "Day": 26, "Month": 6},
  {"Title": "روز جهاني مسجد", "Day": 21, "Month": 8},
  {"Title": " روز جهاني جهانگردي", "Day": 27, "Month": 9},
  {"Title": "روز جهاني ناشنوايان", "Day": 30, "Month": 9},
  {"Title": "روز جهاني سالمندان", "Day": 1, "Month": 10},
  {"Title": "روز جهاني كودك", "Day": 8, "Month": 10},
  {"Title": "روز جهاني استاندارد", "Day": 14, "Month": 10},
  {"Title": "روز جهاني نابينايان (عصاي سفيد)", "Day": 15, "Month": 10},
  {"Title": "روز جهاني معلولان", "Day": 3, "Month": 12}
];
