const hejriEvent = [
  {"Title": "آغاز سال هجري قمري", "Day": 1, "Month": 1},
  {"Title": "تاسوعاي حسيني", "IsVacation": true, "Day": 9, "Month": 1},
  {"Title": "عاشوراي حسيني", "IsVacation": true, "Day": 10, "Month": 1},
  {"Title": "روز تجليل از اسرا و مفقودان", "Day": 11, "Month": 1},
  {
    "Title": "شهادت حضرت امام زين العابدين عليه السلام، 95 هـ ق",
    "Day": 12,
    "Month": 1
  },
  {
    "Title": "تغيير قبلة مسلمين از بيت المقدس به مكة معظمه، 2 هـ ق",
    "Day": 18,
    "Month": 1
  },
  {
    "Title": "شهادت حضرت امام زين العابدين عليه السلام، 95 هـ ق، به روايتي ",
    "Day": 25,
    "Month": 1
  },
  {
    "Title": "ولادت حضرت امام محمد باقر عليه السلام، 57 هـ ق",
    "Day": 3,
    "Month": 2
  },
  {
    "Title": "ولادت حضرت امام موسي كاظم عليه السلام، 128 هـ ق",
    "Day": 7,
    "Month": 2
  },
  {"Title": "اربعين حسيني", "IsVacation": true, "Day": 20, "Month": 2},
  {"Title": "روز وقف", "Day": 27, "Month": 2},
  {
    "Title":
        "رحلت حضرت رسول اكرم صلي الله عليه و آله، 11 هـ ق - شهادت حضرت امام حسن مجتبي عليه السلام، 50 هـ ق",
    "IsVacation": true,
    "Day": 28,
    "Month": 2
  },
  {
    "Title": "شهادت حضرت امام رضا عليه السلام، 203 هـ ق",
    "IsVacation": true,
    "Day": 30,
    "Month": 2
  },
  {
    "Title":
        "هجرت حضرت رسول اكرم صلي الله عليه و آله از مكه به مدينه، اول محرم سال هجرت، مبدأ گاه شماري هجري قمري",
    "Day": 1,
    "Month": 3
  },
  {
    "Title": "شهادت حضرت امام حسن عسكري عليه السلام، 260 هـ ق",
    "Day": 8,
    "Month": 3
  },
  {
    "Title":
        "ميلاد حضرت رسول اكرم صلي الله عليه و آله به روايت اهل سنت - آغاز هفتة وحدت",
    "Day": 12,
    "Month": 3
  },
  {
    "Title":
        "ميلاد حضرت رسول اكرم صلي الله عليه و آله، 53 سال قبل از هجرت، روز اخلاق و مهرورزي - ميلاد حضرت امام جعفر صادق عليه‌السلام مؤسس مذهب جعفري، 83 هـ ق",
    "IsVacation": true,
    "Day": 17,
    "Month": 3
  },
  {
    "Title": "ولادت حضرت امام حسن عسكري عليه السلام، 232 هـ ق",
    "Day": 8,
    "Month": 4
  },
  {
    "Title": "وفات حضرت معصومه سلام الله عليها، 201 هـ ق",
    "Day": 10,
    "Month": 4
  },
  {
    "Title": "ولادت حضرت زينب سلام‌الله عليها، 5 هـ ق،  روز پرستار و بهورز",
    "Day": 5,
    "Month": 5
  },
  {
    "Title": "شهادت حضرت فاطمه زهرا سلام الله عليها، 11 هـ ق، به روايتي",
    "Day": 13,
    "Month": 5
  },
  {
    "Title": "شهادت حضرت فاطمة زهرا سلام الله عليها، 11 هـ ق",
    "IsVacation": true,
    "Day": 3,
    "Month": 6
  },
  {
    "Title": "ولادت حضرت فاطمة زهرا سلام الله عليها، هشتم قبل از هجرت،  روز زن",
    "Day": 20,
    "Month": 6
  },
  {
    "Title": "ولادت حضرت امام محمد باقر عليه‌السلام، 57 هـ ق",
    "Day": 1,
    "Month": 7
  },
  {
    "Title": "شهادت حضرت امام علي النقي الهادي عليه السلام، 254 هـ ق",
    "Day": 3,
    "Month": 7
  },
  {
    "Title": "ولادت حضرت امام محمد تقي عليه السلام «جواد الائمه»، 195 هـ ق",
    "Day": 10,
    "Month": 7
  },
  {
    "Title": "ولادت حضرت امام علي عليه السلام، 23 سال قبل از هجرت",
    "IsVacation": true,
    "Day": 13,
    "Month": 7
  },
  {"Title": "آغاز ايام البيض، اعتكاف", "Day": 13, "Month": 7},
  {"Title": "وفات حضرت زينب سلام الله عليها، 62 هـ ق", "Day": 15, "Month": 7},
  {
    "Title": "شهادت حضرت امام موسي كاظم عليه السلام، 183 هـ ق",
    "Day": 25,
    "Month": 7
  },
  {
    "Title": "مبعث حضرت رسول اكرم صلي الله عليه و آله، 13 سال قبل از هجرت",
    "IsVacation": true,
    "Day": 27,
    "Month": 7
  },
  {
    "Title": "ولادت حضرت امام حسين عليه السلام، 4 هـ ق، روز پاسدار",
    "Day": 3,
    "Month": 8
  },
  {
    "Title": "ولادت حضرت ابوالفضل العباس عليه السلام، 26 هـ ق، روز جانباز",
    "Day": 4,
    "Month": 8
  },
  {
    "Title": "ولادت حضرت امام زين العابدين عليه السلام، 38 هـ ق",
    "Day": 5,
    "Month": 8
  },
  {
    "Title": "ولادت حضرت علي اكبر عليه السلام، 33 هـ ق، روز جوان",
    "Day": 11,
    "Month": 8
  },
  {
    "Title": "ولادت حضرت قائم عجل الله تعالي فرجه، 255 هـ ق",
    "IsVacation": true,
    "Day": 15,
    "Month": 8
  },
  {"Title": "روز جهاني مستضعفان", "Day": 15, "Month": 8},
  {
    "Title": "وفات حضرت خديجه سلام الله عليها، 3 سال قبل از هجرت",
    "Day": 10,
    "Month": 9
  },
  {
    "Title": "ولادت حضرت امام حسن مجتبي عليه‌السلام، 3 هـ ق، روز اكرام",
    "Day": 15,
    "Month": 9
  },
  {"Title": "شب قدر", "Day": 18, "Month": 9},
  {"Title": "ضربت خوردن حضرت علي عليه السلام، 40 هـ ق", "Day": 19, "Month": 9},
  {"Title": "شب قدر", "Day": 20, "Month": 9},
  {
    "Title": "شهادت حضرت علي عليه السلام، 40 هـ ق",
    "IsVacation": true,
    "Day": 21,
    "Month": 9
  },
  {"Title": "شب قدر", "Day": 22, "Month": 9},
  {
    "Title": "روز جهاني قدس (آخرين جمعه ماه رمضان)",
    "RuleType": 1,
    "Month": 9,
    "DayOfWeek": 6,
    "Nth": "-1"
  },
  {"Title": "عيد سعيد فطر", "IsVacation": true, "Day": 1, "Month": 10},
  {"Title": "تعطیلی عيد سعيد فطر", "IsVacation": true, "Day": 2, "Month": 10},
  {
    "Title": "شهادت حضرت امام جعفر صادق عليه السلام، 148 هـ ق",
    "IsVacation": true,
    "Day": 25,
    "Month": 10
  },
  {
    "Title": "ولادت حضرت معصومه سلام الله عليها، 173 هـ ق، روز ملي دختران",
    "Day": 1,
    "Month": 11
  },
  {
    "Title": "ولادت حضرت امام رضا عليه السلام، 148 هـ ق",
    "Day": 11,
    "Month": 11
  },
  {
    "Title": "شهادت حضرت امام محمد تقي عليه السلام «جوادالائمه»، 220 هـ ق",
    "Day": 29,
    "Month": 11
  },
  {
    "Title":
        "سالروز ازدواج حضرت علي عليه السلام و حضرت فاطمه سلام الله عليها، 2 هـ ق",
    "Day": 1,
    "Month": 12
  },
  {
    "Title":
        "شهادت مظلومانه زائران خانه خدا به دستور آمريكا به دست مأموران آل سعود، 1366 هـ ش ـ برابر با 6 ذي الحجه 1407 هـ ق",
    "Day": 6,
    "Month": 12
  },
  {
    "Title": "شهادت حضرت امام محمد باقر عليه السلام، 114 هـ ق",
    "Day": 7,
    "Month": 12
  },
  {"Title": "روز عرفه - روز نيايش", "Day": 9, "Month": 12},
  {"Title": "عيد سعيد قربان", "IsVacation": true, "Day": 10, "Month": 12},
  {
    "Title": "ولادت حضرت امام علي النقي الهادي عليه‌السلام، 212 هـ ق",
    "Day": 15,
    "Month": 12
  },
  {
    "Title": "عيد سعيد غديرخم، 10 هـ ق",
    "IsVacation": true,
    "Day": 18,
    "Month": 12
  },
  {
    "Title": "روز مباهله پيامبر اسلام صلي الله عليه و آله، 10 هـ ق",
    "Day": 24,
    "Month": 12
  },
  {"Title": "روز خانواده و تكريم بازنشستگان", "Day": 25, "Month": 12}
];
